stevenj/avr-libc3/include/avr/io/atmega32hvbrevb.h
/* Charge Over-current Protection Activated Interrupt Enable */
#define BATTERY_PROTECTION_COCIE_CLEAR_gc (0x00) /* Charge Over-current Protection Activated Interrupt Enable - CLEAR */
#define BATTERY_PROTECTION_COCIE_SET_gc   (0x04) /* Charge Over-current Protection Activated Interrupt Enable - SET */


/* Discharger High-current Protection Activated Interrupt */
#define BATTERY_PROTECTION_DHCIE_CLEAR_gc (0x00) /* Discharger High-current Protection Activated Interrupt - CLEAR */
#define BATTERY_PROTECTION_DHCIE_SET_gc   (0x02) /* Discharger High-current Protection Activated Interrupt - SET */


/* Charger High-current Protection Activated Interrupt */
#define BATTERY_PROTECTION_CHCIE_CLEAR_gc (0x00) /* Charger High-current Protection Activated Interrupt - CLEAR */
#define BATTERY_PROTECTION_CHCIE_SET_gc   (0x01) /* Charger High-current Protection Activated Interrupt - SET */


/*
--------------------------------------------------------------------------------
CHARGER_DETECT - Charger Detect
--------------------------------------------------------------------------------
*/


/* BATT Pin Voltage Level */
#define CHARGER_DETECT_BATTPVL_CLEAR_gc (0x00) /* BATT Pin Voltage Level - CLEAR */
#define CHARGER_DETECT_BATTPVL_SET_gc   (0x10) /* BATT Pin Voltage Level - SET */


/* Charger Detect Interrupt Sense Control */
#define CHARGER_DETECT_CHGDCSR_CHGDISC_gc(x) ((x<<2) & 0x0C)

/* Charger Detect Interrupt Flag */
#define CHARGER_DETECT_CHGDIF_CLEAR_gc (0x00) /* Charger Detect Interrupt Flag - CLEAR */
#define CHARGER_DETECT_CHGDIF_SET_gc   (0x02) /* Charger Detect Interrupt Flag - SET */


/* Charger Detect Interrupt Enable */
#define CHARGER_DETECT_CHGDIE_CLEAR_gc (0x00) /* Charger Detect Interrupt Enable - CLEAR */
#define CHARGER_DETECT_CHGDIE_SET_gc   (0x01) /* Charger Detect Interrupt Enable - SET */


/*
--------------------------------------------------------------------------------
VOLTAGE_REGULATOR - Voltage Regulator
--------------------------------------------------------------------------------
*/


/* ROC Status */
#define VOLTAGE_REGULATOR_ROCS_CLEAR_gc (0x00) /* ROC Status - CLEAR */
#define VOLTAGE_REGULATOR_ROCS_SET_gc   (0x80) /* ROC Status - SET */


/* ROC Disable */
#define VOLTAGE_REGULATOR_ROCD_CLEAR_gc (0x00) /* ROC Disable - CLEAR */
#define VOLTAGE_REGULATOR_ROCD_SET_gc   (0x10) /* ROC Disable - SET */


/* ROC Warning Interrupt Flag */
#define VOLTAGE_REGULATOR_ROCWIF_CLEAR_gc (0x00) /* ROC Warning Interrupt Flag - CLEAR */
#define VOLTAGE_REGULATOR_ROCWIF_SET_gc   (0x02) /* ROC Warning Interrupt Flag - SET */


/* ROC Warning Interrupt Enable */
#define VOLTAGE_REGULATOR_ROCWIE_CLEAR_gc (0x00) /* ROC Warning Interrupt Enable - CLEAR */
#define VOLTAGE_REGULATOR_ROCWIE_SET_gc   (0x01) /* ROC Warning Interrupt Enable - SET */


/*
--------------------------------------------------------------------------------
BANDGAP - Bandgap
--------------------------------------------------------------------------------
*/


/* Bandgap Disable */
#define BANDGAP_BGD_CLEAR_gc (0x00) /* Bandgap Disable - CLEAR */
#define BANDGAP_BGD_SET_gc   (0x20) /* Bandgap Disable - SET */


/* Bandgap Short Circuit Detection Enabled */
#define BANDGAP_BGSCDE_CLEAR_gc (0x00) /* Bandgap Short Circuit Detection Enabled - CLEAR */
#define BANDGAP_BGSCDE_SET_gc   (0x10) /* Bandgap Short Circuit Detection Enabled - SET */


/* Bandgap Short Circuit Detection Interrupt Flag */
#define BANDGAP_BGSCDIF_CLEAR_gc (0x00) /* Bandgap Short Circuit Detection Interrupt Flag - CLEAR */
#define BANDGAP_BGSCDIF_SET_gc   (0x02) /* Bandgap Short Circuit Detection Interrupt Flag - SET */


/* Bandgap Short Circuit Detection Interrupt Enable */
#define BANDGAP_BGSCDIE_CLEAR_gc (0x00) /* Bandgap Short Circuit Detection Interrupt Enable - CLEAR */
#define BANDGAP_BGSCDIE_SET_gc   (0x01) /* Bandgap Short Circuit Detection Interrupt Enable - SET */


/*
--------------------------------------------------------------------------------
CPU - CPU Registers
--------------------------------------------------------------------------------
*/


/* Global Interrupt Enable */
#define CPU_I_CLEAR_gc (0x00) /* Global Interrupt Enable - CLEAR */
#define CPU_I_SET_gc   (0x80) /* Global Interrupt Enable - SET */


/* Bit Copy Storage */
#define CPU_T_CLEAR_gc (0x00) /* Bit Copy Storage - CLEAR */
#define CPU_T_SET_gc   (0x40) /* Bit Copy Storage - SET */


/* Half Carry Flag */
#define CPU_H_CLEAR_gc (0x00) /* Half Carry Flag - CLEAR */
#define CPU_H_SET_gc   (0x20) /* Half Carry Flag - SET */


/* Sign Bit */
#define CPU_S_CLEAR_gc (0x00) /* Sign Bit - CLEAR */
#define CPU_S_SET_gc   (0x10) /* Sign Bit - SET */


/* Two's Complement Overflow Flag */
#define CPU_V_CLEAR_gc (0x00) /* Two's Complement Overflow Flag - CLEAR */
#define CPU_V_SET_gc   (0x08) /* Two's Complement Overflow Flag - SET */


/* Negative Flag */
#define CPU_N_CLEAR_gc (0x00) /* Negative Flag - CLEAR */
#define CPU_N_SET_gc   (0x04) /* Negative Flag - SET */


/* Zero Flag */
#define CPU_Z_CLEAR_gc (0x00) /* Zero Flag - CLEAR */
#define CPU_Z_SET_gc   (0x02) /* Zero Flag - SET */


/* Carry Flag */
#define CPU_C_CLEAR_gc (0x00) /* Carry Flag - CLEAR */
#define CPU_C_SET_gc   (0x01) /* Carry Flag - SET */


/* Clock Output Enable */
#define CPU_CKOE_CLEAR_gc (0x00) /* Clock Output Enable - CLEAR */
#define CPU_CKOE_SET_gc   (0x20) /* Clock Output Enable - SET */


/* Pull-up disable */
#define CPU_PUD_CLEAR_gc (0x00) /* Pull-up disable - CLEAR */
#define CPU_PUD_SET_gc   (0x10) /* Pull-up disable - SET */


/* Interrupt Vector Select */
#define CPU_IVSEL_CLEAR_gc (0x00) /* Interrupt Vector Select - CLEAR */
#define CPU_IVSEL_SET_gc   (0x02) /* Interrupt Vector Select - SET */


/* Interrupt Vector Change Enable */
#define CPU_IVCE_CLEAR_gc (0x00) /* Interrupt Vector Change Enable - CLEAR */
#define CPU_IVCE_SET_gc   (0x01) /* Interrupt Vector Change Enable - SET */


/* OCD Reset Flag */
#define CPU_OCDRF_CLEAR_gc (0x00) /* OCD Reset Flag - CLEAR */
#define CPU_OCDRF_SET_gc   (0x10) /* OCD Reset Flag - SET */


